aaron
abc
abiding
ability
able
abortion
absence
absolute
absolutely
abstract
absurd
abuse
academic
acceleration
accelerator
accept
acceptable
acceptance
accepted
accepting
access
accessdigexnet
accident
accidents
accomplish
accomplished
according
account
accounts
accuracy
accurate
accurately
accused
achieve
achieved
acid
acknowledge
acquire
across
act
acting
action
actions
active
actively
activities
activity
acts
actual
actually
adam
adams
adapter
add
added
adding
addition
additional
address
addressed
addresses
addressing
adds
adequate
adjust
administration
administrator
admit
admitted
adobe
adopted
ads
adult
adults
advance
advanced
advantage
advantages
advertising
advice
advocate
affairs
affect
affected
afford
afraid
africa
afternoon
afterwards
age
agencies
agency
agenda
agent
agents
ages
ago
agree
agreed
agreement
ahead
aid
aids
aimed
aint
air
aircraft
aix
aka
alabama
alan
alaska
albert
alberta
alcohol
alex
alexander
algorithm
algorithms
alien
alike
alink
alive
allan
alleged
allen
allow
allowed
allowing
allows
almost
alone
along
alot
alpha
already
also
alt
altatheism
alternative
alternatives
although
altogether
always
ama
amateur
amazed
amazing
amendment
america
american
americans
ames
amiga
among
amongst
amount
amounts
amp
amusing
analog
analogy
analysis
anatolia
ancient
anderson
andi
andre
andrew
andy
angeles
angels
anger
angle
angry
animal
animals
animation
ann
announce
announced
announcement
annoying
annual
anonymous
another
answer
answered
answering
answers
antenna
anthony
anti
anybody
anymore
anyone
anyones
anything
anyway
anyways
anywhere
apart
apollo
apologies
apologize
apostles
app
apparent
apparently
appeal
appear
appearance
appeared
appears
apple
apples
applicable
application
applications
applied
applies
apply
applying
appreciate
appreciated
appressian
approach
approaches
appropriate
approval
approved
approx
approximately
apps
apr
april
arab
arabs
arbitrary
arbor
architecture
archive
archives
area
areas
arena
argic
argue
argued
arguing
argument
arguments
arizona
arm
armed
armenia
armenian
armenians
arms
army
around
arras
array
arrest
arrived
arrogance
arrogant
art
arthur
article
articles
artificial
arts
ascii
aside
ask
asked
asking
asks
aspect
aspects
ass
assault
assembly
assert
assertion
assist
assistance
assistant
associate
associated
associates
association
assume
assumed
assumes
assuming
assumption
assumptions
assured
astronomy
atf
atheism
atheist
atheists
athens
ati
atlanta
atmosphere
atmospheric
atrocities
attached
attack
attacked
attacking
attacks
attempt
attempted
attempting
attempts
attention
attitude
attorney
attributed
audience
audio
august
austin
australia
austria
author
authorities
authority
authorized
authors
auto
automatic
automatically
automobile
automotive
availability
available
ave
avenue
average
avoid
avoided
award
aware
away
awesome
awful
azerbaijan
babies
baby
back
backed
background
backing
backup
bad
badly
bag
baker
balance
balanced
ball
balls
baltimore
ban
band
bands
bandwidth
bang
bank
banks
banned
bar
barely
barry
bars
base
baseball
based
bases
basic
basically
basis
bat
batf
batteries
battery
batting
battle
baud
bay
bbs
bds
beach
beam
bear
bearing
beast
beat
beating
beats
beautiful
beaverton
became
become
becomes
becoming
bed
beer
began
begin
beginning
begins
begun
behave
behavior
behaviour
behind
beings
beleive
belief
beliefs
believe
believed
believer
believers
believes
believing
bell
belong
belongs
belt
ben
bench
benedikt
benefit
benefits
berkeley
besides
best
bet
beta
better
beware
beyer
beyond
bias
biased
bible
biblical
big
bigger
biggest
bike
biker
bikes
bill
billion
bills
binary
biological
biology
bios
bird
birth
bit
bitmap
bitnet
bits
black
blame
blank
blast
blessed
blew
blind
block
blocks
blood
blow
blowing
blown
blue
blues
bmp
bmw
bnr
board
boards
bob
bobby
bodies
body
boeing
bomb
bombing
bonds
book
books
boost
boot
boots
border
borders
boring
born
bos
bosnia
bosnian
bosnians
boss
boston
bother
bothered
bottom
bought
boulder
bound
box
boxes
boy
boys
bps
brad
bradley
brain
brains
brake
brakes
branch
brand
braves
break
breaking
breaks
breath
brent
brett
brian
brief
briefly
bright
bring
bringing
brings
britain
british
broad
broadcast
broke
broken
brookline
brother
brothers
brought
brown
bruce
bruins
brunswick
bryan
btw
buck
bucks
budget
buffalo
buffer
bug
bugs
build
building
buildings
built
bull
bullet
bulletin
bullets
bullshit
bunch
burden
bureau
burn
burned
burning
burns
burst
bus
bush
business
busy
butt
button
buttons
buy
buyer
buying
byte
bytes
cable
cables
cache
cad
cage
cal
calgary
calif
california
call
called
calling
calls
cambridge
came
camera
cameras
camp
campaign
campbell
campus
canada
canadian
canadians
cancer
candidate
canon
cap
capabilities
capability
capable
capacity
capital
capitals
caps
captain
capture
captured
car
card
cards
care
career
careful
carefully
cares
carl
carnegie
carolina
carpenter
carried
carries
carry
carrying
cars
carter
cartridge
case
cases
cash
cast
cat
catalog
catch
category
catholic
catholics
caught
cause
caused
causes
causing
cds
cease
cell
cells
cellular
center
centers
central
centre
centris
centuries
century
certain
certainly
chain
chair
challenge
champaign
champion
champions
champs
chance
chances
change
changed
changes
changing
channel
channels
chapel
chapter
character
characteristics
characters
charge
charged
charges
charles
charlie
charter
chastity
cheap
cheaper
check
checked
checking
checks
cheers
chemical
chemistry
chen
chest
chicago
chief
child
children
chinese
chip
chips
choice
choices
choose
choosing
chose
chosen
chris
christ
christian
christianity
christians
christopher
christs
chronic
chuck
church
churches
cia
cincinnati
circle
circles
circuit
circuits
circumstances
cis
cite
cited
cities
citizen
citizens
city
civil
civilian
civilians
civilization
claim
claimed
claiming
claims
clarify
clark
clarke
class
classes
classic
classified
clayton
clean
cleaning
cleansing
clear
clearly
cleveland
clh
click
client
clients
cliff
clinic
clinical
clinton
clintons
clip
clipper
clock
clone
close
closed
closely
closer
closest
cloud
club
clue
clutch
cnn
coach
coast
code
codes
coffee
cold
collapse
collect
collected
collection
college
collins
collision
color
colorado
colors
colour
columbia
columbus
column
com
combination
combined
come
comes
comfortable
coming
command
commands
comment
comments
commercial
commission
commit
commitment
committed
committee
common
commonly
communicate
communication
communications
communist
communities
community
comp
compact
companies
company
comparable
compare
compared
comparing
comparison
comparisons
compatibility
compatible
compete
competing
competition
compile
compiled
compiler
complain
complaining
complaints
complete
completed
completely
complex
complicated
component
components
compound
comprehensive
compressed
compression
compromise
compuserve
computation
computer
computers
computing
con
concentrate
concept
concepts
concern
concerned
concerning
concerns
conclude
concluded
conclusion
conclusions
concrete
condemn
condemned
condition
conditions
conduct
conducted
conference
confidence
configuration
confirm
confirmed
conflict
conflicts
confuse
confused
confusing
confusion
congress
connect
connected
connection
connections
connector
connectors
conner
consensus
consent
consequences
conservative
consider
considerable
considerably
consideration
considerations
considered
considering
consistent
consistently
consists
conspiracy
constant
constantly
constitution
constitutional
construction
consultant
consultants
consulting
consumer
contact
contacts
contain
contained
containing
contains
content
contents
context
continue
continued
continues
continuing
contract
contradict
contradiction
contradictory
contrary
contrast
contrib
contribute
contributed
contributions
control
controlled
controller
controls
convenient
convention
conventional
conversation
conversations
conversion
convert
converted
converter
converting
convex
conviction
convince
convinced
convincing
cook
cookamunga
cool
cooperation
cop
copies
cops
copy
copying
copyright
core
cornell
corner
corners
corp
corporate
corporation
correct
corrected
correction
corrections
correctly
corresponding
corrupt
cost
costs
council
count
counted
counter
countries
country
counts
county
couple
course
court
courts
cover
coverage
covered
covering
covers
covington
cpr
cpu
crack
craig
cramer
crap
crash
crashes
crazy
create
created
creates
creating
creation
creative
creator
credit
crew
crime
crimes
criminal
criminals
crisis
criteria
critical
criticism
cross
crowd
crucial
cry
crypto
cryptographic
cryptography
crystal
csutexasedu
cubs
cult
cultural
culture
cunixbcccolumbiaedu
cup
cure
curious
current
currently
cursor
curtis
curve
custom
customer
customers
cut
cuts
cutting
cycle
cylinder
daily
dakota
dale
dallas
damage
damaged
damn
damned
dan
danger
dangerous
daniel
danny
dare
dark
dartmouth
data
database
date
dates
daughter
dave
david
davidian
davidians
davis
day
days
dead
deal
dealer
dealers
dealing
deals
dealt
dean
dear
death
deaths
debate
dec
decade
decades
december
decent
decide
decided
decides
decision
decisions
declare
declared
dedicated
deep
deeply
default
defence
defend
defending
defense
defensive
define
defined
defines
definite
definitely
definition
definitions
degree
degrees
delaware
delay
delete
deleted
deliberately
delivered
delivery
delta
demand
demands
demo
democracy
democratic
demonstrate
demonstrated
demonstration
denied
denning
dennis
density
denver
deny
denying
department
depend
dependent
depending
depends
dept
depth
der
derek
derived
des
describe
described
describes
describing
description
desert
deserve
deserves
design
designed
designs
desire
desired
desk
desktop
despite
destroy
destroyed
destroying
destruction
det
detail
detailed
details
detect
detector
detectors
determine
determined
detroit
develop
developed
developers
developing
development
device
devices
devil
devils
devoted
diagnosed
dial
dialog
diamond
dick
dictionary
die
died
diego
diet
differ
difference
differences
different
differential
differently
difficult
difficulty
digest
digital
digitized
dir
direct
directed
direction
directly
director
directories
directory
dirt
dirty
dis
disagree
disappear
disaster
discharge
disclaimer
disclaimers
discount
discover
discovered
discrimination
discuss
discussed
discussing
discussion
discussions
disease
diseases
disk
disks
display
displayed
displaying
displays
dispute
disregard
distance
distant
distinction
distinguish
distribute
distributed
distribution
district
div
divided
dividian
divine
division
doc
docs
doctor
doctors
doctrine
doctrines
document
documentation
documented
documents
dod
dodge
dog
dogs
dollar
dollars
domain
domestic
don
donald
done
door
doors
dorothy
dos
dot
double
doubt
doug
douglas
download
dozen
draft
drag
draw
drawing
drawn
dream
dreams
drew
drink
drinking
drive
driven
driver
drivers
drives
driving
drop
dropped
dropping
drops
drove
drug
drugs
dry
dual
duck
due
duke
dumb
dump
dunn
duo
durham
dust
duty
dying
dynamic
dynamics
earl
earlier
early
ears
earth
ease
easier
easily
east
eastern
easy
eat
eating
economic
economics
economy
edge
edit
edited
editing
edition
editor
editorial
edmonton
edt
education
educational
edward
eff
effect
effective
effectively
effectiveness
effects
efficient
effort
efforts
egypt
eight
einstein
eisa
either
elaborate
elected
election
electric
electrical
electricity
electronic
electronics
element
elements
elias
eliminate
elizabeth
else
elses
elsewhere
email
emergency
emotional
emphasis
empire
employed
employees
employer
employment
empty
enable
encounter
encountered
encourage
encouraged
encrypted
encryption
end
ended
ending
ends
enemies
enemy
energy
enforce
enforcement
eng
engaged
engine
engineer
engineering
engineers
engines
england
english
enhanced
enjoy
enough
ensure
enter
entered
entering
enterpoopmitedu
entire
entirely
entitled
entity
entry
environment
environmental
equal
equally
equipment
equipped
equivalent
era
eric
erik
error
errors
escape
escaped
escrow
esp
especially
espn
essence
essential
essentially
establish
established
establishment
estimated
etc
eternal
ethernet
ethics
ethnic
europe
european
europeans
evaluate
evaluation
evans
even
evening
event
events
eventually
ever
every
everybody
everyone
everything
everywhere
evidence
evil
evolution
exact
exactly
examination
examine
examined
example
examples
excellent
except
exception
exceptions
excessive
exchange
exciting
exclusive
exclusively
excuse
execute
executed
executive
exercise
exhaust
exist
existance
existed
existence
existent
existing
exists
exit
expand
expanded
expansion
expect
expected
expecting
expense
expensive
experience
experienced
experiences
experiment
experimental
experiments
expert
experts
expires
explain
explained
explaining
explains
explanation
explicit
explicitly
exploration
export
exportlcsmitedu
exposed
exposure
express
expressed
expression
ext
extend
extended
extension
extensions
extensive
extent
extermination
external
extra
extreme
extremely
eye
eyes
face
faces
facilities
facility
fact
factor
factors
factory
facts
fail
failed
failing
fails
failure
fair
fairbanks
fairly
faith
fall
fallen
falling
falls
false
fame
familiar
families
family
famous
fan
fanatic
fancy
fans
fantasy
faq
far
farm
fascist
fashion
fast
faster
fastest
fat
fatal
fate
father
fathers
fault
favor
favorite
fax
fbi
fear
feasible
feature
features
feb
february
fed
federal
feds
fee
feed
feedback
feel
feeling
feelings
feels
feet
felix
fell
fellow
felt
female
fewer
fiction
fidonet
field
fields
fifth
fight
fighting
figure
figured
figures
file
files
fill
filled
film
filter
final
finally
finals
financial
find
finding
findings
finds
fine
finger
fingers
finish
finished
finland
fire
firearm
firearms
fired
fires
firing
firm
firmly
first
fischer
fish
fit
fits
five
fix
fixed
fixes
flag
flame
flames
flaming
flash
flat
fled
flesh
flight
floating
floor
floppies
floppy
florida
flow
fly
flyers
flying
focus
folks
follow
followed
followers
following
follows
followup
followups
font
fonts
food
foods
fool
fools
foot
football
force
forced
forces
forcing
ford
foreign
forever
forget
forgive
forgot
forgotten
form
formal
format
formats
formed
former
formerly
forms
forsale
fort
forth
fortunately
forum
forward
forwarded
found
foundation
founded
four
fourth
fox
fpu
frame
france
francis
francisco
frank
frankly
fred
free
freedom
freely
freeman
french
frequency
frequent
frequently
fresh
freshman
fri
friday
friend
friendly
friends
front
ftp
fuck
fuel
full
fully
fun
function
functionality
functions
fund
fundamental
funded
funding
funds
funny
furthermore
future
gain
galaxy
game
games
gamma
gang
garage
garbage
gardner
gary
gas
gateway
gather
gathered
gave
gay
gaza
gear
gee
gene
general
generally
generate
generated
generation
generator
generic
genesis
genocide
geometry
george
georgia
gerald
german
germans
germany
get
gets
getting
giant
giants
gif
gift
girl
girls
give
given
gives
giving
glad
glass
glenn
global
glory
gmt
gnu
goal
goalie
goals
god
gods
goes
going
gold
golden
gone
gonna
good
gordon
gore
gospel
got
gotta
gotten
government
governments
govt
grab
grace
grade
graduate
graham
grand
grant
granted
graphic
graphics
grateful
gravity
gray
great
greater
greatest
greatly
greece
greek
greeks
green
greenbelt
greetings
greg
gregg
gregory
grenades
gretzky
grew
grey
grief
gross
ground
grounds
group
groups
grow
growing
growth
guarantee
guaranteed
guard
guess
guest
gui
guide
guidelines
guilt
guilty
gulf
gun
guns
guy
guys
habit
hacker
hackers
hair
half
hall
hamilton
hand
handbook
handed
handgun
handguns
handle
handled
handles
handling
hands
handy
hang
hanging
happen
happened
happening
happens
happy
hard
harder
hardly
hardware
harm
harmful
harris
harry
harvard
harvey
hat
hate
hatred
hawks
hayes
head
headed
header
heading
heads
health
healthy
hear
heard
hearing
heart
hearts
heat
heaven
heavily
heavy
hebrew
heck
height
helainscwruedu
held
hello
helmet
help
helped
helpful
helping
helps
helsinki
hence
henry
herein
hewlett
hey
hidden
hide
hiding
high
higher
highest
highly
highway
hill
hint
hints
historical
history
hit
hitler
hits
hitter
hitting
hmm
hmmm
hockey
hold
holding
holds
hole
holes
holland
holocaust
holy
home
homeland
homes
homosexual
homosexuality
homosexuals
honda
honest
honestly
honor
hook
hooked
hope
hopefully
hopes
hoping
hopkins
horizontal
horrible
horse
hospital
hospitals
host
hostile
hot
hour
hours
house
houses
houston
howard
however
hst
hudson
huge
hughes
huh
human
humanity
humans
humor
hundred
hundreds
hung
hunter
hunting
hurt
husband
hypothesis
ian
ibm
ice
icon
icons
ide
idea
ideal
ideas
identical
identified
identify
identity
idiot
idiots
idle
ignorance
ignorant
ignore
ignored
ignoring
iii
iisi
illegal
illinois
image
images
imagination
imagine
imaging
imho
immediate
immediately
immoral
imo
impact
implement
implementation
implemented
implications
implied
implies
imply
import
importance
important
impossible
impressed
impression
impressive
improve
improved
improvement
inability
inc
inch
inches
incident
incidents
inclined
include
included
includes
including
income
incompatible
incorporated
incorrect
increase
increased
increases
increasing
incredible
incredibly
indeed
independence
independent
index
indiana
indians
indicate
indicated
indicates
indication
individual
individuals
industrial
industry
inet
inevitable
inexpensive
infection
infections
infinite
influence
info
inform
information
informed
infrastructure
inhabitants
inherent
inherently
initial
initially
initiative
injured
injuries
injury
inner
inning
innings
innocent
input
inputs
insane
insert
inside
insight
insist
inspired
install
installation
installed
installing
instance
instances
instead
institute
instruction
instructions
instrument
instruments
insult
insurance
int
integrated
integrity
intel
intellect
intellectual
intelligence
intelligent
intend
intended
intent
intention
intentionally
interactive
interest
interested
interesting
interests
interface
interference
intergraph
interior
internal
international
internet
interpret
interpretation
interpretations
interpreted
interrupt
intervention
interview
interviews
introduced
introduction
invalid
invasion
invented
investigate
investigation
investment
investors
invited
involve
involved
involvement
involves
involving
iowa
ira
iran
iraq
iron
irq
irrational
irrelevant
irvine
isa
islam
islamic
island
islanders
israel
israeli
israelis
israels
issue
issued
issues
italy
item
items
itll
jack
jackson
jail
jake
james
jan
janet
january
japan
japanese
jason
jay
jays
jeff
jefferson
jeffrey
jerry
jersey
jerusalem
jesus
jet
jets
jew
jewish
jews
jim
jimmy
job
jobs
joe
joel
john
johns
johnson
join
joined
joint
joke
jon
jonathan
jones
jordan
jose
joseph
josh
journal
joy
jpeg
jpl
judaism
judge
judged
judgement
judges
judging
judgment
july
jump
jumper
jumpers
june
junk
just
justice
justification
justified
justify
kansas
keep
keeping
keeps
keith
kelly
ken
kennedy
kenneth
kent
kentucky
kept
kevin
key
keyboard
keys
keywords
kick
kicked
kid
kids
kill
killed
killing
kills
kim
kind
kinda
kinds
king
kingdom
kings
kingston
kit
knew
knock
knocked
know
knowing
knowledge
known
knows
koresh
koreshs
ksand
kurds
lab
label
labor
laboratories
laboratory
labs
lack
lacking
lady
laid
lake
land
landed
landing
lands
lane
language
languages
large
largely
larger
largest
larry
laser
last
late
lately
later
latest
latter
laugh
laughed
launch
launched
law
lawrence
laws
lawyer
lawyers
lay
layer
layout
lciii
lead
leader
leaders
leadership
leading
leads
leafs
league
lean
learn
learned
learning
least
leave
leaves
leaving
lebanese
lebanon
led
lee
left
leg
legal
legally
legislation
legitimate
legs
lehigh
lemieux
length
leo
less
lesson
let
letter
letters
letting
level
levels
levine
lewis
liability
liar
lib
liberal
libertarian
liberties
liberty
libraries
library
license
licensed
lie
lies
life
lifetime
lift
light
lights
like
liked
likely
likes
likewise
limit
limitations
limited
limiting
limits
lincoln
line
linear
lines
link
linked
links
linux
list
listed
listen
listening
listing
lists
literally
literature
little
live
lived
lives
livesey
living
livni
load
loaded
loading
loads
lobby
local
locate
located
location
locations
lock
locked
locks
log
logic
logical
login
logo
london
long
longer
look
looked
looking
looks
loop
loose
lord
los
lose
losing
loss
lost
lot
lots
loud
louis
louisiana
love
loved
loves
loving
low
lower
lowest
ltd
luck
lucky
luis
luke
lunar
lunch
lying
mac
machine
machines
macintosh
macs
mad
made
madison
mag
magazine
magazines
magic
magnitude
mail
mailer
mailing
main
mainly
mainstream
maintain
maintained
maintaining
maintenance
major
majority
make
makes
making
malcolm
male
man
manage
managed
management
manager
managers
manitoba
mankind
manner
mans
manual
manuals
manufacture
manufactured
manufacturer
manufacturers
manufacturing
many
map
maple
mapping
mar
marc
march
mario
mark
marked
market
marketing
marks
marriage
married
mars
martin
mary
maryland
mask
mass
massachusetts
massacre
massacres
masses
massive
master
masters
match
material
materials
math
mathematical
mathematics
mathew
matt
matter
matters
matthew
max
maximum
maybe
maynard
mcgill
mean
meaning
meaningful
meaningless
means
meant
meanwhile
measure
measured
measures
mechanical
mechanism
media
medical
medicine
medium
meet
meeting
meg
megs
melbourne
melkonian
mellon
member
members
membership
memorial
memory
men
mental
mention
mentioned
mentions
menu
mercury
mere
merely
mess
message
messages
messiah
met
metal
method
methods
mets
mexico
mhz
michael
michigan
micro
microsoft
microsystems
mid
middle
mighty
mike
mile
mileage
miles
military
militia
miller
million
millions
milwaukee
min
mind
minded
minds
mine
mini
minimal
minimum
minister
ministry
minnesota
minor
minorities
minority
minute
minutes
miracle
mirror
mirrors
misc
miss
missed
missing
mission
missions
missouri
mistake
mistaken
mistakes
mit
mitchell
mitre
mix
mixed
mode
model
models
modem
modems
moderator
modern
modes
modified
modify
module
moment
mon
monday
money
monitor
monitoring
monitors
month
monthly
months
montreal
moon
moore
moral
morality
morally
morals
moreover
morgan
mormons
morning
morris
moslem
mostly
mother
motherboard
mothers
motif
motion
motivated
motivation
motor
motorcycle
motorcycles
motorola
mount
mountain
mountains
mounted
mouse
mouth
move
moved
movement
moves
movie
movies
moving
mph
msdos
msg
much
multi
multiple
murder
murdered
murders
murphy
murray
muscle
museum
music
muslim
muslims
mustang
mutual
mvp
mystery
myth
naive
name
named
namely
names
narrow
nasa
nasty
nation
national
nations
native
natural
naturally
nature
naval
navy
nazi
nazis
ncr
near
nearby
nearly
neat
nec
necessarily
necessary
necessity
neck
need
needed
needless
needs
negative
neighbor
neighbors
neil
neither
nelson
net
netcom
netherlands
netters
network
networking
networks
neutral
never
nevertheless
new
newer
news
newsgroup
newsgroups
newspaper
newspapers
newsreader
next
nhl
nice
nicely
nichols
nick
night
nights
nine
nixon
nntp
nobody
noise
noisy
non
none
nonsense
nope
normal
normally
norman
norris
north
northern
norton
norway
nose
note
noted
notes
nothing
notice
noticed
notion
nov
novell
november
now
nowhere
nra
nsa
nuclear
null
number
numbers
numerous
nuntius
nuts
nyc
nyx
oak
oakland
obey
object
objections
objective
objects
obo
observation
observations
observatory
observe
observed
observer
obtain
obtained
obvious
obviously
occasionally
occasions
occupation
occupied
occur
occurred
occurs
october
odd
odds
odwyer
offense
offensive
offer
offered
offering
offers
office
officer
officers
offices
official
officially
officials
often
ohanus
ohio
oil
oilers
okay
oklahoma
olchowy
old
older
oliver
omissions
one
ones
online
ontario
onto
oops
open
opened
opening
openwindows
operate
operating
operation
operations
operator
opinion
opinions
opponents
opportunities
opportunity
oppose
opposed
opposing
opposite
opposition
optical
optilink
option
optional
options
orbit
orbital
order
ordered
orders
ordinary
oregon
organization
organizations
organized
orientation
oriented
origin
original
originally
originator
orthodox
others
otherwise
ottawa
outcome
outer
output
outright
outs
outside
overall
overtime
overwhelming
owned
owner
owners
ownership
owns
oxford
pacific
pack
package
packages
packard
packet
pad
page
pages
paid
pain
painful
paint
pair
palestine
palestinian
palestinians
palmer
pan
panel
paper
papers
paragraph
parallel
parameters
paranoia
paranoid
parent
parents
paris
park
parking
part
partial
partially
participants
participate
participated
particular
particularly
parties
partners
parts
party
pasadena
pascal
pass
passage
passages
passed
passenger
passes
passing
password
past
pat
patch
patches
path
patient
patients
patrick
pattern
paul
pay
paying
payload
pays
pcs
peace
peaceful
penalties
penalty
penguins
penn
pennsylvania
pens
people
peoples
per
percent
percentage
perfect
perfectly
perform
performance
performed
performing
perhaps
period
periods
permanent
permission
permit
perry
person
personal
personally
personnel
persons
perspective
petaluma
pete
peter
pgp
phase
phd
phenomenon
phil
philadelphia
phill
phillies
philosophical
philosophy
phone
phones
photo
photography
phrase
physical
physically
physician
physicians
physics
pick
picked
picking
picks
picture
pictures
piece
pieces
pilot
pin
pins
pirates
pissed
pit
pitch
pitched
pitcher
pitchers
pitches
pitching
pitt
pittsburgh
pixel
pixels
place
placed
places
plain
plan
plane
planes
planet
planetary
planets
planned
planning
plans
plant
plastic
plate
platform
platforms
plausible
play
played
player
players
playing
playoff
playoffs
plays
please
pleased
plenty
plot
plug
plugs
plus
pocket
point
pointed
pointer
pointers
pointing
points
police
policies
policy
political
politically
politicians
politics
poll
polytechnic
pool
poor
poorly
pop
pope
popular
population
port
portable
portal
portion
portland
ports
position
positions
positive
possession
possibilities
possibility
possible
possibly
post
posted
poster
posters
posting
postings
posts
postscript
potential
potentially
potvin
pound
pounds
power
powerbook
powered
powerful
powers
practical
practically
practice
practiced
practices
praise
pray
prayer
pre
precise
precisely
predict
predicted
prediction
predictions
prefer
preferably
preference
preferred
prejudice
prepared
presence
present
presentation
presented
presents
preserve
president
presidents
press
pressed
pressure
presumably
presume
pretend
pretty
prevent
prevented
preventing
previous
previously
price
priced
prices
pricing
priest
primarily
primary
prime
primitive
prince
princeton
principle
principles
print
printed
printer
printers
printing
prior
prison
privacy
private
pro
probability
probably
probe
problem
problems
procedure
procedures
proceeded
process
processes
processing
processor
processors
produce
produced
produces
producing
product
production
products
professional
professor
profit
program
programmer
programmers
programming
programs
progress
project
projects
promise
promised
promises
promote
prompt
proof
propaganda
proper
properly
properties
property
prophet
prophets
proposal
proposals
propose
proposed
proprietary
propulsion
protect
protected
protecting
protection
protest
protocol
proud
prove
proved
proven
proves
provide
provided
provides
providing
proving
pseudo
psychological
psychology
pub
public
publication
publications
publicly
publish
published
publishing
puck
pull
pulled
pulling
punish
punishment
purchase
purchased
purchasing
purdue
pure
purely
purpose
purposes
push
pushed
pushing
put
puts
putting
pyramid
quadra
qualified
qualify
quality
quantity
quantum
quarter
que
quebec
query
question
questions
quick
quickly
quiet
quit
quite
quote
quoted
quotes
quoting
quran
race
racial
racism
racist
radar
radiation
radical
radio
radius
raid
rain
raise
raised
ralph
ram
ran
ranch
random
randy
range
rangers
rape
rapidly
rare
rarely
rate
rated
rates
rather
rating
ratio
rational
raw
ray
reach
reached
reaching
reaction
reactions
read
reader
readers
readily
reading
readme
reads
ready
reagan
real
realistic
reality
realize
realized
really
rear
reason
reasonable
reasonably
reasoning
reasons
rec
recall
receive
received
receiver
receiving
recent
recently
recognition
recognize
recognized
recommend
recommendations
recommended
record
recorded
recording
records
recovery
recsporthockey
red
reduce
reduced
reducing
reduction
redundancy
ref
refer
reference
references
referred
referring
refers
reflect
reform
refuse
refused
regard
regarded
regarding
regardless
regards
regime
region
regional
register
registered
registration
regular
regularly
regulation
regulations
reject
rejected
relate
related
relating
relation
relations
relationship
relative
relatively
relatives
release
released
releases
relevant
reliability
reliable
relief
religion
religions
religious
rely
remain
remained
remaining
remains
remark
remarks
remember
remind
reminds
remote
removal
remove
removed
removing
render
rendering
reno
rent
rep
repair
repeat
repeated
repeatedly
replace
replaced
replacement
replacing
replied
replies
reply
report
reported
reporting
reports
repost
represent
representative
representatives
represented
represents
republic
reputation
request
requested
requests
require
required
requirement
requirements
requires
requiring
research
researchers
reserve
reserved
reset
residents
resist
resistance
resolution
resolutions
resolve
resort
resource
resources
respect
respectively
respond
responded
responding
response
responses
responsibility
responsible
rest
restore
restrict
restricted
restrictions
result
resulted
resulting
results
resurrection
return
returned
returning
returns
rev
reveal
revealed
revelation
revenue
reverse
review
revision
revolution
rgb
rice
rich
richard
richardson
rick
rid
ride
rider
riders
ridiculous
riding
rifles
right
righteous
rights
ring
rings
rise
risk
risks
river
road
roads
rob
robert
roberts
robin
rochester
rock
rocket
rockets
rocketswstratuscom
rocks
rod
roger
rogers
role
roll
rom
roman
romans
roms
ron
roof
room
root
rose
rosenau
ross
rotation
rough
roughly
round
route
routine
routines
row
roy
royal
rsa
rubber
rule
ruled
rules
ruling
rumor
rumors
run
running
runs
rush
rushdie
russ
russell
russia
russian
russians
rutgers
ryan
sabres
sacred
sacrifice
sad
sadly
safe
safely
safer
safety
sahak
said
saint
sake
sale
sales
salt
salvation
sam
sample
samples
samuel
san
sandvik
santa
sat
satan
satellite
satellites
satisfied
satisfy
saturday
saturn
save
saved
saves
saving
saw
say
saying
says
scale
scan
scanner
scared
scary
scenario
scene
schedule
scheduled
scheme
schemes
schneider
scholars
school
schools
sci
scicrypt
science
sciences
scientific
scientist
scientists
scope
score
scored
scores
scoring
scott
scratch
screen
screens
screw
screwed
script
scripture
scriptures
scsi
sdpa
sea
sealed
sean
search
searching
season
seasons
seat
seats
seattle
sec
second
secondary
secondly
seconds
secret
secretary
secrets
section
sections
sector
secular
secure
security
see
seeing
seek
seeking
seem
seemed
seems
seen
sees
selanne
select
selected
selection
selective
self
sell
selling
sells
semi
senate
senators
send
sender
sending
senior
sense
sensitive
sensitivity
sensor
sent
sentence
separate
separated
separately
separation
seperate
september
sequence
serbs
serdar
serial
series
serious
seriously
serve
served
server
servers
serves
service
services
servicing
serving
session
sessions
set
sets
setting
settings
settle
settled
setup
seven
several
severe
sex
sexual
sgi
shack
shadow
shaft
shame
shameful
shape
shaped
share
shared
shareware
sharing
sharks
sharp
sheet
shelf
shift
ship
shipped
shipping
shit
shoot
shooting
shop
short
shorter
shortly
shot
shots
shoulder
show
showed
showing
shown
shows
shut
shuttle
sick
side
sides
sig
sigh
sight
sign
signal
signals
signature
signed
significance
significant
significantly
signs
silence
silent
silicon
silly
silver
similar
similarly
simm
simms
simon
simple
simply
simultaneously
sin
since
sincerely
singer
single
sins
sir
sit
site
sites
sitting
situation
situations
six
size
sized
sizes
skepticism
skill
skills
skin
sky
slaughter
slave
sleep
slick
slide
slight
slightly
slip
slot
slots
slow
slower
slowly
small
smaller
smart
smith
smoke
smooth
snail
snow
social
socialist
society
socket
soft
software
solar
sold
soldiers
sole
solely
solid
solntzewpdsgicom
solution
solutions
solve
solved
somebody
someday
somehow
someone
someones
something
sometime
sometimes
somewhat
somewhere
son
sons
sony
soon
sooner
sophisticated
sorry
sort
sorts
sought
soul
souls
sound
sounds
source
sources
south
southern
soviet
sox
space
spacecraft
span
sparc
spare
speak
speaker
speakers
speaking
speaks
spec
special
species
specific
specifically
specification
specified
specify
specs
spectrum
speculation
speech
speed
speeds
spell
spelling
spencer
spend
spending
spent
spin
spirit
spiritual
split
spoke
spoken
sponsored
sport
sports
spot
spread
spreading
spring
springs
square
stable
stadium
staff
stage
stan
stand
standard
standards
standing
standings
stands
stanford
stanley
star
stars
start
started
starting
starts
startup
stat
state
stated
stateedu
statement
statements
states
static
stating
station
stations
statistical
statistics
stats
status
stay
stayed
steal
stealing
stealth
steel
steering
step
stephen
steps
stereo
sternlight
steve
steven
stevens
stewart
stick
still
stock
stockholm
stolen
stomach
stone
stood
stop
stopped
stopping
stops
storage
store
stored
stores
stories
storm
story
straight
strange
strategy
stratus
stream
street
streets
strength
stress
stretch
strict
strictly
strike
strikes
string
strip
strong
stronger
strongly
struck
structure
structures
struggle
stuck
student
students
studied
studies
study
studying
stuff
stupid
stupidity
style
sub
subject
subjective
subjects
submit
subscribe
subsequent
substance
substantial
substitute
success
successful
successfully
suck
sucks
sudden
suddenly
sue
suffer
suffered
suffering
sufficient
sufficiently
suggest
suggested
suggesting
suggestion
suggestions
suggests
suicide
suit
suitable
suite
sum
summarize
summary
summer
sun
sunday
sunnyvale
sunos
suns
super
superior
superstition
supplied
supplies
supply
support
supported
supporters
supporting
supports
suppose
supposed
supposedly
supreme
sure
surely
surface
surgery
surprise
surprised
surprising
surrender
surrounding
survey
survival
survive
survivors
suspect
suspension
sutherland
svga
swap
sweden
swing
swiss
switch
switched
switches
switching
switzerland
sword
symptoms
syndrome
sys
system
systems
table
tactics
tail
take
taken
takes
taking
talent
talk
talked
talking
talks
tank
tanks
tap
tape
tapes
tapped
target
targets
task
tasks
taste
taught
tavares
tax
taxes
taylor
tcp
teach
teacher
teaches
teaching
teachings
team
teams
tear
tech
technical
technically
technique
techniques
technological
technologies
technology
ted
teeth
tektronix
tel
telecom
telecommunications
telephone
telescope
television
tell
telling
tells
telnet
temp
temperature
temple
temporary
ten
tend
tends
tennessee
tens
term
terminal
terminals
terms
terrible
terribly
territories
territory
terrorism
terrorist
terrorists
terry
test
testament
tested
testimony
testing
tests
texas
text
texts
thank
thanks
thanx
theists
theodore
theology
theoretical
theories
theory
therapy
thereby
therefore
thermal
thin
thing
things
think
thinking
thinks
third
thomas
thompson
thou
though
thought
thoughts
thousand
thousands
thread
threads
threat
threatened
threatening
three
threw
throughout
throw
throwing
thrown
thru
thu
thursday
thus
ticket
tickets
tie
tied
tiff
tight
till
tim
time
timer
times
timing
timothy
tin
tiny
tip
tips
tire
tired
tires
title
toal
today
todays
todd
together
told
tolerance
tom
tommy
tomorrow
tone
tonight
tony
took
tool
toolkit
tools
top
topic
topics
tor
toronto
torture
tortured
total
totally
touch
tough
tourist
toward
towards
tower
town
toxic
toyota
trace
track
tracking
trade
traded
tradition
traditional
traffic
tragedy
train
trained
training
transfer
translated
translation
transmission
transmit
transmitted
trap
trash
travel
treat
treated
treating
treatment
tree
trees
trend
trial
trials
trick
tricks
tried
tries
trigger
trinity
trip
triple
trips
trivial
troops
trouble
troy
truck
trucks
true
truly
trust
trusted
truth
try
trying
tube
tucson
tue
tuesday
tune
turbo
turkey
turkish
turks
turn
turned
turner
turning
turns
twenty
twice
twin
two
type
types
typical
typically
typing
ugly
ultimate
ultimately
ultra
unable
understand
understanding
understood
unfortunate
unfortunately
uniform
union
unique
unit
united
units
univ
universal
universe
universities
university
unix
unknown
unless
unlike
unlikely
unnecessary
unto
unusual
update
updated
upgrade
upgraded
upgrading
upon
upper
ups
upset
urbana
usa
usable
usage
use
used
useful
useless
usenet
user
useragent
users
uses
using
usr
ussr
usual
usually
utah
utilities
utility
utter
utterly
utzoo
uucp
uunet
vacuum
valid
valley
valuable
value
values
valve
van
vancouver
variable
variety
various
vary
vast
vax
veal
vehicle
vehicles
vendor
vendors
verify
verse
verses
version
versions
versus
vertical
vesa
vga
via
vice
victim
victims
victoria
victory
video
view
viewed
viewer
viewing
viewpoint
views
village
villages
vincent
violated
violation
violations
violence
violent
virgin
virginia
virtual
virtually
virus
visible
vision
visit
visual
vlb
vms
vnews
voice
void
vol
voltage
volume
voluntary
volunteer
vote
votes
voting
vram
waco
wade
wait
waited
waiting
wake
walk
walked
walker
walking
walks
wall
walls
walter
wanna
want
wanted
wanting
wants
war
ward
warm
warned
warning
warrant
warranty
warren
wars
wash
washington
waste
wasted
wasting
watch
watched
watching
water
waterloo
watts
wave
way
wayne
ways
weak
weapon
weapons
wear
wearing
weather
wednesday
week
weekend
weekly
weeks
weight
weird
welcome
went
west
western
whatever
whatsoever
wheel
wheels
whenever
whereas
wherever
whether
white
whoever
whole
whose
wide
widely
widespread
widget
widgets
width
wife
wild
william
williams
willing
wilson
win
wind
window
windows
wing
wings
winner
winning
winnipeg
wins
winter
wire
wires
wiretap
wiring
wisconsin
wisdom
wise
wish
wishes
within
without
witness
witnesses
woman
women
won
wonder
wondered
wonderful
wondering
wood
word
words
work
worked
workers
working
works
workstation
workstations
world
worlds
worried
worry
worse
worship
worst
worth
worthless
worthwhile
worthy
wounded
wow
wright
write
writer
writers
writes
writing
writings
written
wrong
wrote
wwii
xlib
xterm
xview
xxdate
xxmessage
yale
yamaha
yankees
yeah
year
years
yeast
yellow
yep
yes
yesterday
yet
york
young
younger
youth
yugoslavia
yup
zealand
zero
zip
zone
zoology
