abc
abdominal
abilities
ability
able
abnormal
abortion
abraham
abroad
abs
absence
absolute
absolutely
absorb
absorbed
abt
abuse
abused
abusive
academic
academy
acceleration
accent
accept
acceptable
acceptance
accepted
accepting
access
accessories
accident
accidentally
accomplish
accomplished
according
account
accounting
accounts
accurate
accused
achieve
achieved
acid
acids
across
act
acted
acting
action
actions
active
activities
activity
actor
actors
actress
acts
actual
actually
adam
adams
add
added
addicted
addiction
adding
addition
additional
address
addresses
adds
adjust
administration
administrator
admission
admit
admitted
adobe
adopt
adopted
ads
adult
adults
advance
advanced
advantage
advantages
advertise
advertising
advice
advise
affair
affairs
affect
affected
affecting
affects
afford
afghanistan
afraid
africa
african
afternoon
afterwards
age
agencies
agency
agenda
agent
agents
ages
ago
agree
agreed
agreement
agrees
ahead
aid
aids
aim
aint
air
airport
aka
alabama
alarm
album
albums
alcohol
algebra
alien
aliens
alike
alive
allah
allergic
allergies
allow
allowed
allowing
allows
almost
alone
along
alot
already
alright
also
alternate
alternative
although
always
amazing
amendment
america
american
americans
americas
among
amongst
amount
amounts
analysis
anatomy
ancestors
ancient
angel
angeles
angels
anger
angle
angry
animal
animals
anime
announced
annoying
annual
another
ans
answer
answered
answering
answers
answersyahoocom
anti
antibiotics
antivirus
anxiety
anybody
anymore
anyone
anything
anytime
anyway
anyways
anywhere
aol
apart
apartment
apparently
appeal
appear
appearance
appeared
appears
apple
application
applications
applied
applies
apply
applying
appointment
appreciate
appreciated
approach
appropriate
approval
approve
approved
approximately
april
arab
arabic
area
areas
argentina
argue
argument
arguments
arizona
arm
armed
arms
army
around
arranged
arrest
arrested
arrive
arrived
arrogant
art
article
articles
artist
artists
arts
asap
ashamed
asia
asian
aside
ask
asked
asking
asks
asleep
aspect
aspects
ass
asset
assets
assigned
assignment
assist
assistance
assistant
associate
associated
association
assume
assumed
assuming
ate
atheist
atheists
athletic
atleast
atmosphere
atom
atomic
atoms
attach
attached
attack
attacked
attacking
attacks
attempt
attempting
attempts
attend
attending
attention
attitude
attorney
attract
attracted
attraction
attractive
audience
audio
august
aunt
australia
australian
author
authorities
authority
auto
automatic
automatically
available
avatar
average
avg
avoid
awake
award
awarded
awards
aware
away
awesome
awful
awhile
awkward
axis
babies
baby
bachelors
back
background
backs
backup
backwards
bacteria
bad
badly
bag
balance
balanced
ball
balls
ban
band
bands
bang
bank
banks
banned
bar
barely
bars
base
baseball
based
bases
basic
basically
basics
basis
basketball
bass
bat
bath
bathroom
battery
battle
bay
beach
beans
bear
bears
beat
beating
beautiful
beauty
became
become
becomes
becoming
becuase
bed
bedroom
beer
began
begin
beginning
begins
behave
behavior
behaviour
behind
beings
beleive
belief
beliefs
believe
believed
believers
believes
believing
belive
bell
belly
belong
belongs
belt
ben
bench
bend
beneath
beneficial
benefit
benefits
bent
beside
besides
best
bet
beta
better
beyond
bible
biblical
big
bigger
biggest
bike
bill
billion
billions
bills
billy
bin
biological
biology
bird
birds
birth
birthday
bit
bite
bits
black
blacks
bladder
blame
blank
bleed
bleeding
bless
blessed
blind
block
blocked
blocking
blocks
blog
blonde
blood
blow
blowing
blown
blue
board
boards
boat
bob
bodies
body
bodys
boil
boiling
bomb
bombs
bond
bonds
bone
bones
book
books
boost
boot
border
borders
bored
boring
born
borrow
boss
boston
bother
bothers
bottle
bottom
bought
bound
bout
bow
bowl
box
boxes
boxing
boy
boyfriend
boyfriends
boys
brain
brains
branch
branches
brand
brazil
bread
break
breakfast
breaking
breaks
breast
breasts
breath
breathe
breathing
bridge
brief
bright
brilliant
bring
bringing
brings
britain
british
broad
broke
broken
broker
brother
brothers
brought
brown
browse
browser
brush
btw
bubble
bucks
buddy
budget
bug
bugs
build
building
buildings
built
bulk
bump
bumps
bunch
buried
burn
burned
burning
burns
bus
bush
bushs
business
businesses
busy
butt
butter
button
buy
buying
bye
cable
cables
caffeine
cake
cal
calcium
calculate
calculated
calculator
calculus
california
call
called
calling
calls
calm
calorie
calories
came
camera
camp
campaign
canada
canadian
cancel
cancer
candidate
candidates
candy
cap
capable
capacity
capital
captain
capture
car
carbon
carbs
card
cardio
cards
care
cared
career
careers
careful
carefully
cares
caring
carolina
carried
carries
carry
carrying
cars
carter
cartoon
case
cases
cash
cast
cat
catalog
catch
catching
categories
category
catholic
catholics
cats
caught
cause
caused
causes
causing
cds
celebrate
celebration
celebrities
celebrity
cell
cells
cent
center
centers
central
centre
cents
centuries
century
ceremony
certain
certainly
certificate
certification
certified
chain
chair
challenge
champion
champions
championship
chance
chances
change
changed
changes
changing
channel
channels
chapter
character
characteristics
characters
charge
charged
charges
charity
charles
chart
chase
chat
chatting
cheap
cheaper
cheat
cheated
cheating
check
checked
checking
checks
cheer
cheese
chemical
chemicals
chemistry
cheney
chest
chicago
chick
chicken
chicks
chief
child
childhood
children
childrens
childs
china
chinese
chips
chocolate
choice
choices
choose
choosing
chose
chosen
chris
christ
christian
christianity
christians
christmas
chronic
church
churches
cia
circle
circles
circuit
circular
circulation
circumstances
cities
citizen
citizens
citizenship
city
civil
claim
claimed
claiming
claims
class
classes
classic
classical
classified
classroom
clean
cleaner
cleaning
clear
clearly
click
clicking
client
clients
climate
clinical
clinton
clip
clock
close
closed
closely
closer
closest
closet
closing
clothes
clothing
cloud
clouds
club
clubs
clue
coach
coast
coat
code
codes
coffee
cold
collapse
collect
collecting
collection
college
colleges
color
colorado
colored
colors
colour
column
com
combat
combination
combine
combined
come
comedy
comes
comfort
comfortable
coming
command
comment
comments
commerce
commercial
commission
commit
commitment
committed
common
commonly
communicate
communication
communications
communities
community
comp
companies
company
companys
compare
compared
comparison
compatible
compensation
compete
competition
competitive
complain
complaining
complaint
complete
completed
completely
complex
complicated
complications
component
components
composed
compound
compounds
computer
computers
concentrate
concentration
concept
concepts
concern
concerned
concerning
concerns
concert
conclusion
concrete
condition
conditions
condom
conduct
conference
confidence
confident
configuration
confirm
conflict
confuse
confused
confusing
confusion
congress
connect
connected
connection
connections
cons
conscious
consent
consequences
conservative
conservatives
consider
consideration
considered
considering
consistent
consists
conspiracy
constant
constantly
constitution
construction
consult
consume
consumed
consumer
consuming
contact
contacted
contacting
contacts
contain
contained
container
containing
contains
content
contents
contest
context
continue
continued
continues
continuing
contract
contracts
contrary
contrast
contribute
control
controlled
controlling
controls
conversation
conversations
conversion
convert
converted
converts
convicted
convince
convinced
cook
cookies
cooking
cool
cooler
cop
cope
copies
cops
copy
core
corn
corner
corporate
corporation
corporations
correct
correctly
corresponding
corrupt
corruption
cos
cost
costs
cotton
council
counseling
counselor
count
counter
counting
countries
country
counts
county
couple
couples
courage
course
courses
court
courts
cousin
cousins
cover
coverage
covered
covering
covers
cow
coz
crack
craft
cramps
crap
crash
crazy
cream
create
created
creates
creating
creation
creative
creator
creatures
credit
credits
cricket
crime
crimes
criminal
criminals
crisis
criteria
critical
cross
crossed
crowd
cruel
crush
cry
crying
crystal
ctrl
cultural
culture
cultures
cup
cups
cure
curious
currency
current
currently
curse
curve
custom
customer
customers
cut
cute
cuts
cutting
cuz
cycle
dad
daddy
daily
dallas
damage
damaged
damn
dance
dancing
danger
dangerous
dare
dark
data
database
date
dated
dates
dating
daughter
daughters
david
day
days
dead
deal
dealing
deals
dealt
dear
death
deaths
debate
debt
decade
decades
december
decent
decide
decided
decides
deciding
decision
decisions
declared
decrease
dedicated
deep
deeper
deeply
default
defeat
defeated
defend
defense
defensive
definately
define
defined
definitely
definition
definitions
degree
degrees
del
delete
deleted
deliver
delivered
dell
demand
democracy
democrat
democratic
democrats
denied
density
dental
dentist
deny
department
depend
dependent
depending
depends
deposit
depressed
depression
dept
depth
derivative
derived
des
describe
described
describes
describing
description
desert
deserve
deserves
design
designed
designer
desire
desired
desires
desk
desktop
desperate
despite
destroy
destroyed
destroying
destruction
detail
detailed
details
detect
determination
determine
determined
detroit
develop
developed
developing
development
device
devices
devil
diabetes
diagnosed
diagnosis
dial
diameter
dick
dictionary
die
died
diego
dies
diet
diets
differ
difference
differences
different
differently
difficult
difficulty
dig
digital
dimensions
dinner
dioxide
diploma
direct
directed
direction
directions
directly
director
directory
dirt
dirty
disability
disable
disabled
disagree
disaster
disc
discharge
discipline
discount
discover
discovered
discovery
discrimination
discuss
discussed
discussion
disease
diseases
disgusting
disk
dislike
disney
disorder
disorders
display
displayed
distance
distant
distribution
district
divide
divided
divine
division
divorce
divorced
dna
doc
doctor
doctors
doctrine
document
documentation
documented
documents
dog
dogs
dollar
dollars
domain
domestic
dominant
don
donate
done
door
doors
dos
dose
dosent
dot
double
doubt
download
downloaded
downloading
downloads
draft
drag
drain
drama
draw
drawing
drawn
dream
dreams
dress
dressed
drew
drink
drinking
drinks
drive
driven
driver
drivers
drives
driving
drop
dropped
drops
drug
drugs
drunk
dry
dsl
dual
dude
due
dumb
dump
dunno
dust
dutch
duties
duty
dvd
dvds
dying
eachother
ear
earlier
early
earn
earned
ears
earth
earths
ease
easier
easiest
easily
east
easter
eastern
easy
eat
eaten
eating
eats
ebay
economic
economics
economy
ect
edge
edit
editing
edition
editor
educate
educated
education
educational
effect
effective
effectively
effects
efficient
effort
efforts
egg
eggs
egypt
eight
either
elected
election
elections
electric
electrical
electricity
electron
electronic
electronics
electrons
element
elementary
elements
eligible
eliminate
else
elses
elsewhere
email
emails
embassy
emergency
emotion
emotional
emotionally
emotions
empire
employed
employee
employees
employer
employers
employment
empty
enable
encourage
encouraged
end
ended
ending
ends
enemies
enemy
energy
enforcement
engage
engaged
engine
engineer
engineering
engineers
engines
england
english
enjoy
enjoyed
enjoying
enough
ensure
enter
entered
entering
entertainment
entire
entirely
entitled
entity
entrance
entry
environment
environmental
enwikipediaorg
episode
episodes
equal
equally
equals
equation
equations
equipment
equity
equivalent
era
error
errors
escape
especially
espn
essay
essential
essentially
est
establish
established
estate
esteem
estimate
estimated
etc
eternal
ethics
ethnic
europe
european
evaluate
eve
even
evening
event
events
eventually
ever
every
everybody
everyday
everyone
everyones
everything
everytime
everywhere
evidence
evil
evolution
evolved
exact
exactly
exam
examination
examine
example
examples
exams
excel
excellent
except
exception
exceptions
excess
excessive
exchange
excited
exciting
exclusive
excuse
executive
exercise
exercises
exercising
exist
existed
existence
existing
exists
exit
expand
expanding
expansion
expect
expectations
expected
expecting
expense
expenses
expensive
experience
experienced
experiences
experiencing
experiment
experiments
expert
experts
expired
explain
explained
explains
explanation
explore
explorer
exposed
exposure
express
expressed
expression
extend
extended
extension
extensive
extent
external
extra
extreme
extremely
eye
eyes
face
faced
faces
facilities
facing
fact
factor
factors
factory
facts
fail
failed
failing
fails
failure
fair
fairly
faith
faithful
fake
fall
fallen
falling
falls
false
fame
familiar
families
family
famous
fan
fancy
fans
fantastic
fantasy
far
farm
farther
fashion
fast
faster
fastest
fat
father
fathers
fats
fatty
fault
fav
favor
favorite
favorites
favourite
fbi
fear
fears
feature
features
february
fed
federal
fee
feed
feedback
feeding
feel
feeling
feelings
feels
fees
feet
fell
fellow
felt
female
females
fence
fever
fewer
fiance
fiber
fiction
field
fields
fifa
fifth
fight
fighting
fights
figure
figured
figures
file
filed
files
filing
fill
filled
filling
film
films
filter
final
finally
finals
finance
financial
financially
find
finding
finds
fine
finger
fingers
finish
finished
fire
fired
firefox
firewall
firm
first
fish
fishing
fit
fitness
fits
five
fix
fixed
flag
flash
flat
flesh
flexible
flight
flip
flirt
flirting
floor
florida
flow
flower
flowers
flu
fluid
fluids
fly
flying
focus
focused
folder
folders
folks
follow
followed
followers
following
follows
font
food
foods
fool
foot
football
force
forced
forces
ford
foreign
forest
forever
forget
forgive
forgiveness
forgot
forgotten
form
formal
format
formation
formed
former
forming
forms
formula
forth
fortune
forum
forums
forward
fought
found
foundation
founded
four
fourth
fox
fraction
frame
france
francisco
frank
fraud
freak
free
freedom
freely
freeze
freezing
french
frequency
frequent
frequently
fresh
friction
friday
friend
friendly
friends
friendship
front
fruit
fruits
fuel
full
fully
fun
function
functions
fund
funding
funds
funniest
funny
future
gain
gained
gaining
gal
game
games
gang
gap
garbage
garden
gas
gases
gates
gather
gave
gay
gays
gear
gender
gene
general
generally
generate
generated
generation
generations
genes
genetic
gentle
gently
genuine
george
georgia
german
germany
get
gets
getting
ghost
giant
giants
gift
gifts
girl
girlfriend
girlfriends
girls
give
given
gives
giving
glad
glass
glasses
global
glory
glucose
goal
goals
god
gods
goes
goin
going
gold
golden
golf
gone
gonna
good
goods
google
gospel
got
gotta
gotten
gov
goverment
government
governments
governor
govt
gpa
grab
grace
grade
grades
gradually
graduate
graduated
graduation
grains
grammar
grams
grand
grandmother
grant
granted
grants
graphic
graphics
grass
grateful
gravitational
gravity
great
greater
greatest
greatly
greece
greek
green
grew
grip
grocery
gross
ground
group
groups
grow
growing
grown
grows
growth
guarantee
guard
guess
guessing
guest
guidance
guide
guidelines
guilt
guilty
guitar
gum
gun
guns
guy
guys
gym
habit
habits
haha
hair
half
hall
hand
handed
handle
handling
hands
hang
hanging
happen
happend
happened
happening
happens
happier
happiness
happy
hard
harder
hardest
hardly
hardware
harm
harmful
harry
harsh
hat
hate
hated
hates
hatred
hav
hawaii
head
headache
headaches
headed
heads
heal
healing
health
healthier
healthy
hear
heard
hearing
heart
hearts
heat
heating
heaven
heavily
heavy
hebrew
heck
height
held
hello
help
helped
helpful
helping
helps
hence
henry
hero
hey
hidden
hide
hiding
high
higher
highest
highlight
highly
highschool
hill
hillary
hills
hindu
hint
hip
hire
hired
hiring
historical
history
hit
hitler
hits
hitting
hiv
hmm
hmmm
hockey
hold
holding
holds
hole
holes
holiday
holidays
hollywood
holy
home
homes
homework
homosexual
homosexuality
honest
honestly
honesty
honey
honor
hook
hooked
hop
hope
hopefully
hopes
hoping
horizontal
hormone
hormones
horrible
horse
horses
hospital
hospitals
host
hosting
hot
hotel
hour
hours
house
household
houses
housing
houston
however
hrs
html
http
hubby
hug
huge
huh
human
humanity
humans
humor
hundred
hundreds
hung
hungry
hunt
hunting
hurricane
hurt
hurting
hurts
husband
husbands
hydrogen
iam
ice
icon
idea
ideal
ideas
identified
identify
identity
idiot
idiots
idol
ignorance
ignorant
ignore
ignored
ignoring
iii
illegal
illegally
illegals
illinois
illness
image
images
imagination
imagine
immature
immediate
immediately
immigrant
immigrants
immigration
immune
impact
implies
import
importance
important
importantly
impossible
impression
improve
improved
improvement
improving
inch
inches
incident
include
included
includes
including
income
incorrect
increase
increased
increases
increasing
incredible
indeed
independence
independent
index
indexhtml
indexphp
india
indian
indiana
indians
indicate
indicated
indicates
individual
individuals
industrial
industries
industry
infected
infection
infections
infinite
influence
influenced
info
inform
information
informed
initial
initially
injured
injuries
injury
inner
innocent
input
insane
insert
inside
insight
insist
install
installation
installed
installing
instance
instant
instead
institute
institutions
instructions
insult
insurance
intake
intel
intelligence
intelligent
intend
intended
intense
intensity
intent
interact
interaction
intercourse
interest
interested
interesting
interests
interface
interior
internal
international
internet
interpretation
interview
interviews
intimate
introduce
introduced
invade
invaded
invasion
invented
invention
invest
investigation
investing
investment
invisible
invite
invited
involve
involved
involves
involving
ipod
iran
iraq
iraqi
ireland
irish
iron
irs
islam
islamic
island
islands
isp
israel
issue
issued
issues
italian
italy
item
items
itll
itunes
jack
jackson
jail
james
january
japan
japanese
java
javascript
jealous
jeff
jerk
jersey
jesus
jewish
jews
jim
job
jobs
joe
john
johnny
johnson
join
joined
joining
joint
joints
joke
jokes
jones
jordan
joseph
journal
journey
joy
judge
judgement
judges
judging
judgment
juice
july
jump
jumping
june
junior
junk
jus
just
justice
justified
justify
kansas
keep
keeping
keeps
kelly
kennedy
kept
kerry
kevin
key
keyboard
keys
kick
kicked
kicking
kicks
kid
kidding
kidney
kids
kill
killed
killer
killing
kills
kind
kinda
kinds
king
kingdom
kings
kiss
kissed
kissing
kit
kitchen
knee
knees
knew
kno
knock
know
knowing
knowledge
known
knows
korea
lab
label
labor
laboratory
lack
laden
ladies
lady
laid
lake
lame
land
landing
landlord
lands
language
languages
laptop
laptops
large
largely
larger
largest
last
lasted
lasts
late
lately
later
latest
latin
latter
laugh
laughing
launch
law
laws
lawyer
lawyers
lay
layer
layers
laying
lazy
lbs
lead
leader
leaders
leadership
leading
leads
league
leagues
lean
learn
learned
learning
lease
least
leave
leaves
leaving
led
lee
left
leg
legal
legally
legend
legit
legitimate
legs
length
les
lesbian
less
lesser
lesson
lessons
let
letter
letters
letting
level
levels
liberal
liberals
library
license
licensed
lie
lied
lies
life
lifes
lifestyle
lifetime
lift
lifting
light
lighter
lights
like
liked
likely
likes
likewise
liking
lil
limewire
limit
limitations
limited
limits
lincoln
line
linear
lines
link
linked
links
linux
lips
liquid
list
listed
listen
listening
listing
listings
lists
literally
literature
little
live
lived
liver
lives
living
load
loaded
loads
loan
loans
local
locate
located
location
locations
lock
locked
log
logic
logical
login
logo
lol
london
lonely
long
longer
longest
look
looked
looking
looks
loop
loose
loosing
lord
los
lose
loser
losing
loss
losses
lost
lot
lots
lottery
loud
love
loved
lovely
lover
lovers
loves
loving
low
lower
lowest
luck
lucky
lunch
lung
lungs
lust
luv
lying
lyrics
mac
machine
machines
mad
made
magazine
magazines
magic
magnetic
mail
mailing
mails
main
mainly
maintain
maintenance
mais
major
majority
make
maker
makes
makeup
making
male
males
mall
man
manage
managed
management
manager
mankind
manner
mans
manual
manually
manufacturers
manufacturing
many
map
march
marijuana
marine
mark
marked
market
marketing
markets
marks
marriage
married
marry
mars
mart
martial
martin
mary
mask
mass
massage
masses
massive
master
masters
match
matches
mate
material
materials
math
mathematical
mathematics
maths
matt
matter
matters
matthew
mature
max
maximum
maybe
mba
mcdonalds
meal
meals
mean
meaning
means
meant
measure
measured
measurement
measures
measuring
meat
mechanical
mechanics
mechanism
med
media
medical
medication
medications
medicine
medicines
medium
meds
meet
meeting
meets
melt
member
members
membership
memories
memory
men
mens
mental
mentally
mention
mentioned
menu
mere
merely
mess
message
messages
messed
messenger
met
metabolism
metal
metals
meter
meters
method
methods
mexican
mexicans
mexico
miami
michael
michigan
microsoft
mid
middle
mike
mild
mile
miles
military
milk
million
millions
min
mind
minded
minds
mine
minerals
mini
minimal
minimum
minister
minor
minority
mins
minute
minutes
mirror
miserable
miss
missed
missing
mission
mistake
mistakes
mix
mixed
mixture
mlb
mobile
mode
model
models
modem
moderate
modern
modify
moisture
molecular
molecule
molecules
mom
moment
moments
moms
monday
money
monitor
monkey
monkeys
month
monthly
months
mood
moon
moral
morals
morning
mortgage
mostly
mother
motherboard
mothers
motion
motivated
motivation
motor
mount
mountain
mountains
mouse
mouth
move
moved
movement
movements
moves
movie
movies
moving
mph
msn
much
multi
multiple
multiply
mum
murder
muscle
muscles
music
musical
muslim
muslims
mutual
myspace
mystery
myth
naccording
nafter
nail
nails
naked
nall
nalso
nalthough
nam
name
named
names
nan
nand
nanother
nany
nanyway
nare
narrow
nas
nascar
nasty
nat
nation
national
nations
native
natural
naturally
nature
navy
nba
nbasically
nbe
nbecause
nbefore
nbest
nboth
nbtw
nbut
nby
ncan
ncheck
nclick
ndid
ndo
ndoes
ndont
near
nearby
nearest
nearly
neat
necessarily
necessary
neck
nedit
need
needed
needing
needs
negative
neighbor
neighborhood
neighbors
neither
nero
nerve
nerves
nervous
net
network
networks
neutral
neven
never
nevery
new
newer
news
newspaper
nexample
next
nfinally
nfirst
nfl
nfor
nfrom
nget
ngo
ngod
ngood
nhave
nhe
nhere
nheres
nhis
nhope
nhow
nhowever
nhttp
nice
nicely
nick
nickname
nid
nif
nigeria
night
nights
nill
nim
nin
nine
nis
nit
nitrogen
nits
nive
njust
nkeep
nlet
nlets
nlike
nlook
nlove
nmake
nmany
nmaybe
nmore
nmost
nmy
nnext
nno
nnot
nnote
nnow
noble
nobody
nof
noh
noise
nok
non
nonce
none
nonsense
nope
normal
normally
north
northern
norton
nose
note
notebook
notes
nother
nothing
notice
noticed
novel
november
now
nowadays
nowhere
npeople
npersonally
nplease
nps
nread
nremember
nsecond
nsee
nshe
nshould
nsince
nso
nsome
nsometimes
nsorry
ntake
ntell
nthank
nthanks
nthat
nthats
nthe
nthen
nthere
ntherefore
ntheres
nthese
nthey
nthink
nthis
nthose
nto
ntry
ntwo
nuclear
number
numbers
numerous
nurse
nursing
nuse
nutrients
nutrition
nuts
nwe
nwell
nwhat
nwhen
nwhere
nwhich
nwhile
nwho
nwhy
nwill
nwith
nwould
nyahoo
nyc
nyes
nyou
nyour
object
objective
objects
observe
observed
obsessed
obtain
obtained
obvious
obviously
occasionally
occur
occurred
occurs
ocean
october
odd
odds
offended
offense
offensive
offer
offered
offering
offers
office
officer
officers
offices
official
officially
officials
often
ohio
oil
okay
old
older
oldest
olympic
olympics
omg
one
ones
online
onto
open
opened
opening
opens
operate
operating
operation
operations
opinion
opinions
opponent
opportunities
opportunity
opposed
opposite
opposition
option
options
oral
orange
orbit
order
ordered
orders
ordinary
organ
organic
organism
organisms
organization
organizations
organized
organs
orgasm
oriented
origin
original
originally
originated
others
otherwise
outcome
outer
outlook
output
outside
overall
overcome
overseas
overweight
owe
owned
owner
owners
ownership
owns
oxygen
pace
pacific
pack
package
pagan
page
pages
paid
pain
painful
pains
paint
pair
pakistan
panel
panic
pants
paper
papers
paperwork
paragraph
parallel
parent
parents
paris
park
parking
part
participate
particle
particles
particular
particularly
parties
partner
partners
parts
party
pas
pass
passage
passed
passes
passing
passion
passport
password
past
paste
pastor
path
pathetic
patience
patient
patients
pattern
patterns
paul
pay
paying
payment
payments
pays
pcs
pdf
peace
peaceful
pee
pen
penalty
penis
people
peoples
per
percent
percentage
perception
perfect
perfectly
perform
performance
performed
performing
perhaps
period
periodic
periods
permanent
permanently
permission
permit
person
personal
personality
personally
personnel
persons
perspective
pet
peter
phase
phd
phenomenon
philippines
philosophy
phone
phones
photo
photos
php
phrase
phrases
physical
physically
physician
physics
pic
pick
picked
picking
picks
pics
picture
pictures
pie
piece
pieces
pill
pills
pin
pink
pipe
pissed
pitch
pizza
place
placed
places
plain
plan
plane
planes
planet
planets
planned
planning
plans
plant
plants
plastic
plate
plates
platform
play
played
player
players
playing
playoffs
plays
please
pleasure
plenty
plot
pls
plug
plus
plz
pocket
pockets
poem
point
pointed
pointing
points
polar
pole
police
policies
policy
political
politically
politicians
politics
poll
pollution
pool
poor
poorly
pop
pops
popular
population
porn
port
portion
ports
portugal
position
positions
positive
possibilities
possibility
possible
possibly
post
posted
posting
posts
pot
potential
potentially
pound
pounds
pour
poverty
powder
power
powerful
powers
ppl
practical
practice
practices
pray
prayer
prayers
praying
pre
precious
predict
prefer
preferably
preference
preferences
preferred
pregnancy
pregnant
preparation
prepare
prepared
prescribed
prescription
presence
present
presentation
presented
presents
president
presidential
presidents
press
pressure
pretend
pretty
prevent
preventing
prevents
previous
previously
price
prices
pride
priest
primarily
primary
prime
prince
princess
principal
principle
principles
print
printed
printer
printing
prior
prison
privacy
private
prize
pro
probability
probably
probation
problem
problems
procedure
procedures
process
processes
processing
processor
produce
produced
produces
producing
product
production
products
profession
professional
professionals
professor
profile
profit
profits
program
programming
programs
progress
project
projects
promise
promised
promote
pronounced
proof
proper
properly
properties
property
prophet
proposed
pros
protect
protected
protecting
protection
protective
protein
proteins
protest
proud
prove
proved
proven
proves
provide
provided
provider
providers
provides
providing
psychological
psychology
pts
public
published
pull
pulled
pulling
pump
punished
punishment
purchase
purchased
pure
purple
purpose
purposes
pursue
push
pushed
pushing
put
puts
putting
qid
qualifications
qualified
qualify
qualities
quality
quantity
quarter
que
queen
query
question
questions
qui
quick
quicker
quickly
quiet
quit
quite
quote
quotes
quran
race
races
racial
racing
racism
racist
radiation
radio
radius
rain
raise
raised
raising
ram
ran
random
range
rank
rap
rape
raped
rapid
rapidly
rare
rarely
rate
rated
rates
rather
rating
ratio
rational
raw
ray
rays
reach
reached
reaches
reaching
react
reaction
reactions
read
reader
reading
reads
ready
real
realise
reality
realize
realized
really
realy
reason
reasonable
reasoning
reasons
recall
receive
received
receiving
recent
recently
recieve
recieved
recognition
recognize
recognized
recommend
recommendations
recommended
record
recorded
recording
records
recover
recovery
red
reduce
reduced
reduction
ref
refer
reference
references
referred
referring
refers
reflect
refuse
refused
regard
regarding
regardless
regards
region
regions
register
registered
registration
registry
regret
regular
regularly
regulations
reinstall
rejected
relate
related
relation
relations
relationship
relationships
relative
relatively
relatives
relax
release
released
releases
relevant
reliable
relief
relieve
religion
religions
religious
rely
remain
remained
remaining
remains
remedies
remedy
remember
remind
remote
removal
remove
removed
removing
rent
rental
repair
repeat
replace
replaced
replacement
replied
reply
report
reported
reporting
reports
represent
representatives
represented
represents
republic
republican
republicans
reputation
request
require
required
requirement
requirements
requires
research
researchers
resident
resist
resistance
resolution
resolve
resort
resource
resources
respect
respected
respond
response
responses
responsibilities
responsibility
responsible
rest
restart
restaurant
restore
result
resulting
results
resume
retail
retire
retired
retirement
return
returned
returning
returns
revealed
revenge
revenue
reverse
review
reviews
revolution
reward
rice
rich
richard
rid
riddle
ride
ridiculous
riding
right
rights
ring
rings
rip
rise
risk
risks
rite
river
rivers
road
roads
robert
rock
rocks
rod
role
roles
roll
rolling
roman
romance
romans
romantic
rome
room
rooms
root
roots
rose
rotation
rough
roughly
round
route
router
routine
row
royal
rub
rubber
rude
ruin
rule
rules
rumors
run
running
runs
rural
rush
russia
russian
sacred
sacrifice
sad
saddam
sadly
safe
safely
safer
safety
said
saints
sake
salad
salary
sale
sales
salt
salvation
sample
san
sand
santa
sat
satan
satellite
satisfied
saturday
saudi
save
saved
saving
savings
saw
say
saying
says
scale
scam
scan
scare
scared
scary
scenario
scene
schedule
scholarship
scholarships
school
schooling
schools
science
scientific
scientist
scientists
scope
score
scored
scores
scoring
scotland
scream
screaming
screen
screw
screwed
script
scripture
scroll
sea
search
searched
searches
searching
season
seasons
seat
seats
seattle
sec
second
secondary
seconds
secret
secretary
secrets
section
sections
sector
secure
security
see
seed
seeing
seek
seeking
seem
seemed
seems
seen
sees
select
selected
selection
self
selfish
sell
seller
selling
sells
semester
semi
senate
senator
send
sending
sends
senior
sensation
sense
sensitive
sent
sentence
sentences
separate
separated
separation
seperate
september
sequence
serial
series
serious
seriously
serve
served
server
servers
serves
service
services
serving
session
set
sets
setting
settings
settle
setup
seven
several
severe
severely
sex
sexual
sexually
sexy
shadow
shake
shame
shape
shaped
share
shared
shares
sharing
sharp
shave
sheep
sheet
sheets
shift
ship
shipping
ships
shirt
shit
shock
shocked
shoe
shoes
shoot
shooting
shop
shopping
shops
short
shorter
shortly
shot
shots
shoulder
shoulders
show
showed
shower
showing
shown
shows
shut
shy
sick
side
sides
sight
sign
signal
signals
signed
significant
significantly
signing
signs
silent
silly
silver
similar
simple
simplest
simply
sin
since
sincere
sing
singer
singing
single
sings
sins
sir
sister
sisters
sit
site
sites
sitting
situation
situations
six
size
sized
sizes
skill
skills
skin
skinny
skip
sky
slave
slavery
slaves
sleep
sleeping
slept
slide
slight
slightly
slim
slip
slope
slow
slower
slowly
small
smaller
smallest
smart
smell
smells
smile
smith
smoke
smoking
smooth
snow
soap
soccer
social
society
socks
soda
sodium
soft
software
soil
solar
sold
soldier
soldiers
solid
solution
solutions
solve
solved
solving
somebody
someday
somehow
someone
someones
something
sometime
sometimes
somewhat
somewhere
somthing
son
song
songs
sons
soo
soon
sooner
sooo
sore
sorry
sort
sorts
soul
souls
sound
sounds
source
sources
south
southern
sox
space
spain
spam
spanish
spare
speak
speaker
speakers
speaking
speaks
special
specialist
specially
species
specific
specifically
specified
spectrum
speech
speed
speeds
spell
spelled
spelling
spend
spending
spent
sperm
spin
spinning
spirit
spiritual
split
spoke
spoken
sport
sports
spot
spots
spouse
spray
spread
spring
spybot
spyware
sqrt
square
stable
stadium
staff
stage
stages
stand
standard
standards
standing
stands
star
stars
start
started
starting
starts
startup
starving
state
stated
statement
statements
states
stating
station
stations
statistics
stats
status
stay
stayed
staying
stays
std
steal
stealing
steel
steelers
step
steps
steve
stick
sticks
still
stock
stocks
stole
stolen
stomach
stone
stones
stood
stop
stopped
stopping
stops
storage
store
stored
stores
stories
storm
story
straight
strange
strangers
strategy
stream
street
streets
strength
stress
stressed
stretch
stretching
strict
strike
string
strings
strip
stroke
strong
stronger
strongest
strongly
struck
structure
structures
struggle
struggling
stuck
student
students
studied
studies
studio
study
studying
stuff
stupid
style
styles
sub
subject
subjects
submit
subscription
substance
substances
substitute
subtract
succeed
success
successful
successfully
suck
sucks
sudden
suddenly
sue
suffer
suffered
suffering
sufficient
sugar
suggest
suggested
suggesting
suggestion
suggestions
suggests
suicide
suit
suitable
suits
sum
summer
sun
sunday
sunlight
suns
super
superior
supplement
supplements
supplies
supply
support
supported
supporters
supporting
supports
suppose
supposed
supposedly
supreme
sur
sure
surely
surface
surgeon
surgery
surprise
surprised
surrounding
survey
survival
survive
suspect
suspended
swallow
swear
sweat
sweet
swim
swimming
swing
switch
swollen
symbol
symbols
symptom
symptoms
syndrome
system
systems
tab
table
tables
tag
tail
take
taken
takes
taking
talent
talk
talked
talkin
talking
talks
tall
taller
tan
tank
tap
tape
target
task
tasks
taste
taught
tax
taxes
taylor
tea
teach
teacher
teachers
teaches
teaching
teachings
team
teams
tear
tears
tech
technical
technically
technique
techniques
technology
teen
teenager
teenagers
teens
teeth
telephone
television
tell
telling
tells
temp
temperature
temperatures
temple
temporary
ten
tend
tends
tennis
tension
term
terms
terrible
territory
terror
terrorism
terrorist
terrorists
test
testament
tested
testing
tests
texas
text
tha
thank
thanks
thanksgiving
thanx
theme
theories
theory
ther
therapist
therapy
therefore
thick
thier
thin
thing
things
think
thinking
thinks
third
thirty
tho
thomas
thou
though
thought
thoughts
thousand
thousands
threat
threatened
threatening
three
threw
throat
throughout
throw
throwing
thrown
throws
thru
tht
thumb
thus
ticket
tickets
tie
tied
tiger
tight
til
till
time
times
tiny
tip
tips
tired
tissue
tissues
title
titles
today
todays
toe
toes
together
toilet
told
tolerance
tom
tomorrow
ton
tone
tongue
tonight
tons
tony
took
tool
toolbar
tools
tooth
top
topic
topics
torn
torture
total
totally
touch
touched
touching
tough
tour
tournament
toward
towards
tower
town
towns
toxic
toys
trace
track
tract
trade
trading
tradition
traditional
traffic
train
trained
trainer
training
traits
transfer
transferred
translate
translated
translation
transmitted
transport
transportation
trash
travel
traveling
travels
treat
treated
treating
treatment
treatments
treats
tree
trees
trial
triangle
trick
tricks
tricky
tried
tries
trip
triple
troops
trophy
trouble
troubles
truck
true
truly
trust
trusted
truth
try
trying
tube
tuesday
tuition
tune
turkey
turn
turned
turning
turns
twenty
twice
twin
two
type
typed
types
typical
typically
typing
ugly
ultimate
ultimately
unable
uncle
uncomfortable
underneath
understand
understanding
understands
understood
underwear
une
unfair
unfortunately
unhappy
unhealthy
uniform
uninstall
union
unique
unit
united
units
universal
universe
universities
university
unknown
unless
unlike
unlikely
unsure
unto
unusual
unwanted
update
updated
updates
upgrade
upload
upon
upper
ups
upset
upside
urban
urge
urgent
urine
url
usa
usage
usb
use
used
useful
useless
user
users
uses
using
usual
usually
utility
vacation
vacuum
vagina
valentines
valid
valley
valuable
value
values
van
variable
variables
varies
variety
various
vary
vast
vegetables
veggies
vehicle
vehicles
velocity
verify
versa
verse
verses
version
versions
versus
vertical
vessels
via
vice
victim
victims
victory
video
videos
vietnam
view
views
village
violation
violence
violent
virgin
virginia
virtual
virtually
virus
viruses
visa
visible
vision
visit
visited
visiting
visual
vitamin
vitamins
voice
voltage
volume
volunteer
vote
voted
voters
votes
voting
vous
wage
wages
wait
waited
waiting
wake
wal
walk
walked
walking
walks
wall
walls
walmart
wanna
want
wanted
wanting
wants
war
warm
warming
warning
wars
wash
washing
washington
waste
wasting
wat
watch
watched
watching
water
waters
wave
waves
way
ways
weak
wealth
wealthy
weapon
weapons
wear
wearing
wears
weather
web
webpage
website
websites
wedding
weed
week
weekend
weekends
weekly
weeks
weigh
weighs
weight
weights
weird
welcome
welfare
wen
went
west
western
wet
whatever
whatsoever
wheel
whenever
whereas
wherever
whether
whilst
white
whites
whoever
whole
whose
wide
widely
width
wierd
wife
wifes
wiki
wikipedia
wild
william
williams
willing
win
wind
window
windows
wine
wing
wings
winner
winners
winning
wins
winter
wipe
wire
wireless
wisdom
wise
wish
wishes
wit
witch
within
without
witness
witnesses
wives
wizard
woke
woman
womans
women
womens
won
wonder
wondered
wonderful
wondering
wonders
wood
woods
word
words
wore
work
worked
worker
workers
working
workout
works
world
worlds
worldwide
worn
worried
worry
worrying
worse
worship
worst
worth
worthy
wound
wow
wrestling
write
writer
writers
writing
written
wrong
wrote
wwe
wwii
wwwgooglecom
wwwyoutubecom
yahoo
yall
yankees
yard
yards
yea
yeah
year
years
yellow
yep
yes
yesterday
yet
ylt
yoga
york
young
younger
youth
yrs
zero
zip
zone
